/* -----------------------------------------------------------------------------
 * File name   : bsp_delay.h
 * Author      : PSYM
 * Copyright(C): 2024 PSYM. All rights reserved.
 * -----------------------------------------------------------------------------
 */
#ifndef __bsp_delay_H_
#define __bsp_delay_H_

/* --------------------------------- 包含头文件 --------------------------------- */
#include "main.h"

/* --------------------------------- 类型定义 --------------------------------- */
/* None. */

/* --------------------------------- 宏定义 --------------------------------- */
/* None. */

/* --------------------------------- 扩展变量 --------------------------------- */
/* None. */

/* --------------------------------- 函数声明 --------------------------------- */
void Delay_Init(uint16_t sysclk); /* 初始化延迟函数 */
void Delay_ms(uint16_t nms);      /* 延时nms */
void Delay_us(uint32_t nus);      /* 延时nus */
void HAL_Delay(uint32_t Delay);   /* HAL库的延时函数，HAL库内部用到 */

#endif /* __bsp_delay_H_ */

/*>>>>>>>>>> (C) COPYRIGHT PSYM <<<<<< >>>>>> END OF FILE <<<<<<<<<<*/
