/**
 * -----------------------------------------------------------------------------
 * @file   : bsp_fan.h
 * @author      : PSYM
 * Copyright(C): 2024 PSYM. All rights reserved.
 * -----------------------------------------------------------------------------
 */
#ifndef __bsp_fan_H_
#define __bsp_fan_H_

/* --------------------------------- 包含头文件 --------------------------------- */
#include "main.h"
#include "tim.h"

/* --------------------------------- 类型定义 --------------------------------- */
/* None. */

/* --------------------------------- 宏定义 --------------------------------- */
#define FAN_htimx htim4
#define FAN_CHANNEL TIM_CHANNEL_1
#define FAN_PWM_MAX 100

/* --------------------------------- 扩展变量 --------------------------------- */
/* None. */

/* --------------------------------- 函数声明 --------------------------------- */
void fan_start(void);
void fan_stop(void);
void fan_set_speed(uint8_t *speed);

#endif /* __bsp_fan_H_ */

/*>>>>>>>>>> (C) COPYRIGHT PSYM <<<<<< >>>>>> END OF FILE <<<<<<<<<<*/
